In [21]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [22]:
df = df[['Pclass', 'Sex', 'Age', 'Fare', 'Survived']]
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [23]:
dummies = pd.get_dummies(df.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [24]:
df = pd.concat([df, dummies], axis = "columns")
df.head()

   Pclass     Sex   Age     Fare  Survived  female  male
0       3    male  22.0   7.2500         0       0     1
1       1  female  38.0  71.2833         1       1     0
2       3  female  26.0   7.9250         1       1     0
3       1  female  35.0  53.1000         1       1     0
4       3    male  35.0   8.0500         0       0     1

In [25]:
df.drop("Sex", axis = 1, inplace= True)

In [26]:
df.head()

   Pclass   Age     Fare  Survived  female  male
0       3  22.0   7.2500         0       0     1
1       1  38.0  71.2833         1       1     0
2       3  26.0   7.9250         1       1     0
3       1  35.0  53.1000         1       1     0
4       3  35.0   8.0500         0       0     1

In [27]:
target = df.Survived
input_df = df.drop('Survived', axis = 1)

In [28]:
input_df.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [31]:
input_df.columns[input_df.isna().any()]

Index([], dtype='object')

In [30]:
input_df.Age = input_df.Age.fillna(input_df.Age.mean())

In [38]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(input_df, target, test_size= 0.2)

In [39]:
len(x_test)

179

In [40]:
len(x_train)

712

In [41]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [42]:
model.fit(x_train, y_train)

GaussianNB()

In [43]:
model.score(x_test, y_test)

0.7653631284916201

In [44]:
x_test[:10]

     Pclass        Age      Fare  female  male
140       3  29.699118   15.2458       1     0
747       2  30.000000   13.0000       1     0
662       1  47.000000   25.5875       0     1
648       3  29.699118    7.5500       0     1
764       3  16.000000    7.7750       0     1
231       3  29.000000    7.7750       0     1
295       1  29.699118   27.7208       0     1
134       2  25.000000   13.0000       0     1
305       1   0.920000  151.5500       0     1
673       2  31.000000   13.0000       0     1

In [45]:
y_test[:10]

C:\Users\anjali.jha\AppData\Local\Temp\ipykernel_46936\2588316582.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  y_test[:10]

140    0
747    1
662    0
648    0
764    0
231    0
295    0
134    0
305    1
673    1
Name: Survived, dtype: int64

In [47]:
y_pred = model.predict(x_test[:10])
y_pred

array([1, 1, 0, 0, 0, 0, 0, 0, 1, 0], dtype=int64)

In [48]:
model.predict_proba(x_test[:10])

array([[7.19927654e-02, 9.28007235e-01],
       [3.30934797e-02, 9.66906520e-01],
       [9.18418959e-01, 8.15810412e-02],
       [9.92035428e-01, 7.96457241e-03],
       [9.90135332e-01, 9.86466772e-03],
       [9.92015942e-01, 7.98405813e-03],
       [9.25630497e-01, 7.43695025e-02],
       [9.81925556e-01, 1.80744444e-02],
       [3.48438541e-04, 9.99651561e-01],
       [9.82778519e-01, 1.72214807e-02]])